# Profile Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryConnectorData..::..Profile Property
PipeFittingAndAccessoryConnectorData Class See Also
---
The connector profile.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ConnectorProfileType Profile { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Profile As ConnectorProfileType
	Get
```

Visual C++
---
```text
public:
property ConnectorProfileType Profile {
	ConnectorProfileType get ();
}
```

# See Also
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace